Revit 2026 API

# PathOfTravelUpdateMultiple(Document, IListElementId) Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static int UpdateMultiple(
	Document adoc,
	IList<ElementId> elementsToUpdate
)
```
```vb
Public Shared Function UpdateMultiple (
	adoc As Document,
	elementsToUpdate As IList(Of ElementId)
) As Integer
```
```cpp
public:
static int UpdateMultiple(
	Document^ adoc,
	IList<ElementId^>^ elementsToUpdate
)
```
```fsharp
static member UpdateMultiple :
        adoc : Document *
        elementsToUpdate : IList<ElementId> -> int
```

#### Parameters

adoc Document

elementsToUpdate IListElementId

#### Return Value

Int32

#### Reference

PathOfTravel Class

UpdateMultiple Overload

Autodesk.Revit.DB.Analysis Namespace